IDENTIFICATION DIVISION.
       PROGRAM-ID. CO.
       AUTHOR. NAMA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       SCREEN SECTION.
       01 HAPUS.
          02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MULAI.
       DISPLAY '----------------------'.
       DISPLAY 'TEST COBOL'.
       DISPLAY '----------------------'.
       DISPLAY '**********************'.
       DISPLAY 'OKE SIP, COBOL'.
       DISPLAY '**********************'.
          SELESAI.
       STOP RUN.