IDETIFICATION DIVISION.
PROGRAM-ID. INPUT.
AUTHOR. FERDIAN.
ENVIROMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MHS.
02 NAMA PIC  A(10)
02 NPM PIC X(8)
02 KELAS PIC X (9)
SCREEN SECTION.
01 BERSIHKAN-LAYAR.
02 BLANK SCREEN.
PROCEDURE DIVISION.
MULAI.
DISPLAY BERSIHKAN-LAYAR.
DISPLAY (09, 09) “NAMA : “.
ACCEPT ( , ) NAMA.
DISPLAY (10, 09) “NPM : “.
ACCEPT ( , ) NPM.
DISPLAY (11, 09) “KELAS : “.
ACCEPT ( , ) KELAS.
DISPLAY (13, 09) “ NAMA : “ NAMA.
DISPLAY (14, 09) “ NPM : “ NPM.
DISPLAY (15, 09) “ KELAS : “ KELAS.
SELESAI.
STOP RUN.